benjaminkravets/KW45B41Z/kw45b41zevk_eatt_peripheral_freertos/component/power_manager/core/fsl_pm_core.c
            /*
             * $Branch Coverage Justification$
             * $ref pm_core_c_ref_1$.
             */
            if (s_pmHandle->deviceOption->clean != NULL)
            {
                s_pmHandle->deviceOption->clean();
            }
        }
    }
}

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
/*!
 * brief Register timer controller related functions to power manager.
 *
 * If low power timer is the wakeup source, please remember to register it into power manager by using
 * PM_RegisterWakeupSource() function.
 *
 * param handle Pointer to the pm_handle_t structure
 * param timerStart Low power timer start function, this parameter can be NULL, and it means low power timer is not set
 *  as the wakeup source.
 * param timerStop Low power timer stop function, this parameter can also be set as NULL.
 * param timerSync Low power timer sync function, this parameter can also be set as NULL.
 * param getTimestamp Low power timestamp function, this parameter can also be set as NULL.
 * param getTimerDuration Get timer count function. this parameter can also be set as NULL.
 */
void PM_RegisterTimerController(pm_handle_t *handle,
                                pm_low_power_timer_start_func_t timerStart,
                                pm_low_power_timer_stop_func_t timerStop,
                                pm_low_power_timer_get_timestamp_func_t getTimestamp,
                                pm_low_power_timer_get_duration_func_t getTimerDuration)
{
    assert(handle != NULL);

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    handle->timerStart       = timerStart;
    handle->timerStop        = timerStop;
    handle->getTimerDuration = getTimerDuration;
    handle->getTimestamp     = getTimestamp;

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

void PM_RegisterCriticalRegionController(pm_handle_t *handle,
                                         pm_enter_critical criticalEntry,
                                         pm_exit_critical criticalExit)
{
    assert(handle != NULL);

    handle->enterCritical = criticalEntry;
    handle->exitCritical  = criticalExit;
}

/*!
 * brief Get the actual low power state duration.
 */
uint64_t PM_GetLastLowPowerDuration(void)
{
    return s_pmHandle->getTimerDuration(s_pmHandle->entryTimestamp, s_pmHandle->exitTimestamp);
}
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
/*!
 * brief Register notify element into the selected group.
 *
 * param groupId The group of the notify list, this will affect the execution sequence.
 * param notifyElement The pointer to pm_notify_element_t.
 * return status_t The status of register notify object behavior.
 */
status_t PM_RegisterNotify(pm_notify_group_t groupId, pm_notify_element_t *notifyElement)
{
    assert(notifyElement != NULL);

    status_t status = kStatus_PMSuccess;

    if (LIST_AddTail((list_handle_t) & (s_pmHandle->notifyList[groupId]),
                     (list_element_handle_t) & (notifyElement->link)) != kLIST_Ok)
    {
        status = kStatus_PMFail;
    }

    return status;
}

/*!
 * brief Update notify element's callback function and application data.
 *
 * param notifyElement The pointer to the notify element to update.
 * param callback The callback function to be updated.
 * param data Pointer to the callback function private data.
 */
void PM_UpdateNotify(void *notifyElement, pm_notify_callback_func_t callback, void *data)
{
    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    ((pm_notify_element_t *)notifyElement)->data           = data;
    ((pm_notify_element_t *)notifyElement)->notifyCallback = callback;

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

/*!
 * brief Remove notify element from its notify group.
 *
 * param notifyElement The pointer to the notify element to remove.
 */
status_t PM_UnregisterNotify(void *notifyElement)
{
    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (LIST_RemoveElement((list_element_handle_t) & (((pm_notify_element_t *)notifyElement)->link)) != kLIST_Ok)
    {
        status = kStatus_PMFail;
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
/*!
 * brief Initialize the wakeup source object.
 *
 * param ws    Pointer to the pm_wakeup_source_t variable.
 * param wsId  Used to select the wakeup source, the wsId of each wakeup source can be found in fsl_pm_board.h
 * param service The function to be invoked when wake up source asserted.
 * param enable Used to enable/disable the selected wakeup source.
 */
void PM_InitWakeupSource(pm_wakeup_source_t *ws, uint32_t wsId, pm_wake_up_source_service_func_t service, bool enable)
{
    assert(ws != NULL);

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    ws->wsId    = wsId;
    ws->service = service;
    ws->enabled = enable;
    ws->active  = false;

    if (enable == true)
    {
        (void)LIST_AddTail((list_handle_t) & (s_pmHandle->wakeupSourceList), (list_element_handle_t) & (ws->link));
    }

    (void)(s_pmHandle->deviceOption->manageWakeupSource(ws, enable));

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

/*!
 * brief Enable wakeup source.
 *
 * param ws Pointer to the wakeup source object to be enabled.
 * return status_t The status of enable wakeup source behavior.
 */
status_t PM_EnableWakeupSource(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

