benjaminkravets/KW45B41Z/kw45b41zevk_eatt_peripheral_freertos/component/power_manager/core/fsl_pm_core.c
    if (!(ws->enabled))
    {
        /* Add wake up source to list so PM can parse the list if wake up event
         * occurs, and trigger the service callback if needed */
        (void)LIST_AddTail((list_handle_t) & (s_pmHandle->wakeupSourceList), (list_element_handle_t) & (ws->link));
        status = s_pmHandle->deviceOption->manageWakeupSource(ws, true);

        if (status == kStatus_Success)
        {
            ws->enabled = true;
        }
        else
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_core_c_ref_2$.
             */
            status = kStatus_PMWakeupSourceEnableError;
        }
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}

/*!
 * brief Disable wakeup source
 *
 * param ws Pointer to the wakeup source object to be disabled.
 * return status_t The status of disable wakeup source behavior.
 */
status_t PM_DisableWakeupSource(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (ws->enabled)
    {
        /* Remove the wake up source from the list */
        (void)LIST_RemoveElement((list_element_handle_t) & (ws->link));
        status = s_pmHandle->deviceOption->manageWakeupSource(ws, false);

        if (status == kStatus_Success)
        {
            ws->enabled = false;
        }
        else
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_core_c_ref_2$.
             */
            status = kStatus_PMWakeupSourceDisableError;
        }
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}

/*!
 * brief Checks if any enabled wake up source is responsible for last wake up
 *       event. In such case, it will call the wake up source callback if it
 *       has been registered. Likely to be called from Wake Up Unit IRQ Handler.
 *
 * return status_t The status of handling the wake up event.
 */
status_t PM_HandleWakeUpEvent(void)
{
    status_t status = kStatus_PMSuccess;
    pm_wakeup_source_t *currWakeUpSource;

    if (LIST_GetSize((list_handle_t) & (s_pmHandle->wakeupSourceList)) != 0UL)
    {
        currWakeUpSource = (pm_wakeup_source_t *)(void *)(s_pmHandle->wakeupSourceList.head);

        /* the list should contain only enabled ws */
        assert(currWakeUpSource->enabled == true);

        do
        {
            if (currWakeUpSource->service != NULL)
            {
                if (s_pmHandle->deviceOption->isWakeupSource(currWakeUpSource) == true)
                {
                    /* The wake up source trigger the last wake up event
                     * we can call the callback */
                    status = PM_TriggerWakeSourceService(currWakeUpSource);
                }
            }

            currWakeUpSource = (pm_wakeup_source_t *)(void *)currWakeUpSource->link.next;
        } while (currWakeUpSource != NULL);
    }

    return status;
}

/*!
 * brief If the specfic wakeup event occurs, invoke this API to execute its service function.
 *
 * param ws Pointer to the wakeup source object.
 * return status_t The status of trigger wakeup source behavior.
 */
status_t PM_TriggerWakeSourceService(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (ws->enabled)
    {
        if (ws->active)
        {
            status = kStatus_PMWakeupSourceServiceBusy;
        }
        else
        {
            ws->active = true;
            ws->service();
            ws->active = false;

            status = kStatus_PMSuccess;
        }
    }
    else
    {
        /*
         * $Line Coverage Justification$
         * $ref pm_core_c_ref_2$.
         */
        status = kStatus_PMWakeupSourceEnableError;
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*!
 * brief Used to set constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  code
 *      PM_SetConstraints(Sleep_Mode, 3, PM_RESC_1, PM_RESC_2, PM_RESC_3);
 *  endcode
 *
 * param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * param rescNum The number of resource constraints to be set.
 * return status_t The status of set constraints behavior.
 */
status_t PM_SetConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...)
{
    status_t ret = kStatus_Success;
    uint32_t opMode;
    uint32_t rescShift;
    int32_t inputResc;
    va_list ap;
    int32_t i;
    uint32_t curRescOpMode;
    uint32_t opModeToSet;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (powerModeConstraint != PM_LP_STATE_NO_CONSTRAINT)
    {
        if (powerModeConstraint >= PM_LP_STATE_COUNT)
        {
            /* wrong power mode index passed in parameter */
            ret = kStatus_Fail;
        }
        else
        {
            /* Set power mode constraint */
            s_pmHandle->powerModeConstraintCount[powerModeConstraint]++;
            PM_SetAllowedLowestPowerMode();
        }
    }
    else
    {
        /* No power mode constraint to apply, only ressource constraints */
        ;
    }

    if (rescNum != 0)
    {
        va_start(ap, rescNum);

        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            assert(rescShift < (uint32_t)PM_CONSTRAINT_COUNT);
            curRescOpMode = s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL];
            opModeToSet   = ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            if ((curRescOpMode & opModeToSet) == 0UL)
            {
                s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] |=
                    ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            }
            s_pmHandle->resConstraintCount[rescShift]++;
            s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] |= (1UL << ((uint32_t)rescShift % 32UL));
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Used to release constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  code
 *      PM_ReleaseConstraints(Sleep_Mode, 1, PM_RESC_1);
 *  endcode
 *
 * param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * param rescNum The number of resource constraints to be released.
 * return status_t The status of set constraints behavior.
 */
status_t PM_ReleaseConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...)
{
    status_t ret = kStatus_Success;
    uint32_t opMode;
    uint32_t rescShift;
    int32_t inputResc;
    va_list ap;
    int32_t i;
    uint32_t curRescOpMode;
    uint32_t opModeToRelease;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

