benjaminkravets/KW45B41Z/kw45b41zevk_eatt_peripheral_freertos/component/power_manager/core/fsl_pm_core.c
    if (powerModeConstraint != PM_LP_STATE_NO_CONSTRAINT)
    {
        if (powerModeConstraint >= PM_LP_STATE_COUNT)
        {
            /* wrong power mode index passed in parameter */
            ret = kStatus_Fail;
        }
        else
        {
            /* Release power mode constraint */
            if (s_pmHandle->powerModeConstraintCount[powerModeConstraint] > 0U)
            {
                s_pmHandle->powerModeConstraintCount[powerModeConstraint]--;
            }
            PM_SetAllowedLowestPowerMode();
        }
    }
    else
    {
        /* No power mode constraint to release, only ressource constraints */
        ;
    }

    if (rescNum != 0)
    {
        va_start(ap, rescNum);

        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            curRescOpMode   = s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL];
            opModeToRelease = ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            if ((curRescOpMode & opModeToRelease) != 0UL)
            {
                s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] &=
                    ~((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            }
            if (s_pmHandle->resConstraintCount[rescShift] == 1UL)
            {
                s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] &= ~(1UL << ((uint32_t)rescShift % 32UL));
            }
            s_pmHandle->resConstraintCount[rescShift]--;
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Get current system resource constraints.
 *
 * return Current system constraints.
 */
pm_resc_mask_t PM_GetResourceConstraintsMask(void)
{
    return s_pmHandle->resConstraintMask;
}

/*!
 * brief Get current system allowed power mode.
 *
 * return Allowed lowest power mode.
 */
uint8_t PM_GetAllowedLowestPowerMode(void)
{
    return s_pmHandle->powerModeConstraint;
}
